Neofoxx/pic32prog/adapter-neofoxx.c
/*
 * Interface to PIC32 JTAG port using FT2232-based USB adapter.
 * Supported hardware:
 *  - Olimex ARM-USB-Tiny adapter
 *  - Olimex ARM-USB-Tiny-H adapter
 *  - Olimex ARM-USB-OCD-H adapter
 *  - Olimex MIPS-USB-OCD-H adapter
 *  - Bus Blaster v2 from Dangerous Prototypes
 *  - TinCanTools Flyswatter adapter
 *
 * Copyright (C) 2011-2013 Serge Vakulenko
 *
 * This file is part of PIC32PROG project, which is distributed
 * under the terms of the GNU General Public License (GPL).
 * See the accompanying file "COPYING" for more details.
 */
#include <stdio.h>
#include <stdlib.h>
#include <unistd.h>
#include <fcntl.h>
#include <string.h>
#include <errno.h>
#include <inttypes.h>
#include "adapter.h"
#include "pic32.h"
#include "serial.h"


typedef struct {
    // Common part
    adapter_t adapter;
	char name [64];	// Make const char * again later or something.	

    // Transmit buffer
    uint8_t output [256];
    int bytes_to_write;

    // Receive buffer.
    uint8_t input [256]; 
    int bytes_to_read;
	int bytes_in_buffer;
	int current_pos_input;

	uint32_t speed;
	unsigned interface;	// Remove later?
    uint32_t use_executive;
    uint32_t serial_execution_mode;

	// These should be int8_t, 'cos chars.
	uint8_t capabilities_mcu[64];
	uint8_t capabilities_version_fw[64];
	uint8_t capabilities_version_hw[64];

} neofoxx_adapter_t;


/* TMS header and footer defines */
#define TMS_HEADER_COMMAND_NBITS        4
#define TMS_HEADER_COMMAND_VAL          0b0011
#define TMS_HEADER_XFERDATA_NBITS       3
#define TMS_HEADER_XFERDATA_VAL         0b001
#define TMS_HEADER_XFERDATAFAST_NBITS   3
#define TMS_HEADER_XFERDATAFAST_VAL     0b001
#define TMS_HEADER_RESET_TAP_NBITS      6
#define TMS_HEADER_RESET_TAP_VAL        0b011111

#define TMS_FOOTER_COMMAND_NBITS        2
#define TMS_FOOTER_COMMAND_VAL          0b01
#define TMS_FOOTER_XFERDATA_NBITS       2
#define TMS_FOOTER_XFERDATA_VAL         0b01
#define TMS_FOOTER_XFERDATAFAST_NBITS   2
#define TMS_FOOTER_XFERDATAFAST_VAL     0b01

#define SET_MODE_TAP_RESET  0
#define SET_MODE_EXIT       1
#define SET_MODE_ICSP_SYNC  2

#define PACKET_BYTE			0x70	// 'p'	

#define COMMAND_GET_INFO		0
#define COMMAND_SET_SPEED		1
#define COMMAND_SET_PROG_MODE	2
#define COMMAND_SET_PIN_IO_MODE	3	// Input/output. These three are useful for custom stuff
#define COMMAND_SET_PIN_WRITE	4	// Write to pin
#define COMMAND_SET_PIN_READ	5	// Read pin value
#define COMMAND_SEND			6	// Send command

#define PROG_MODE_TRISTATE	0
#define PROG_MODE_JTAG		1
#define PROG_MODE_ICSP		2

#define PIN_TMS		0
#define PIN_TCK		1
#define PIN_TDI		2
#define PIN_TDO		3
#define PIN_MCLR	4

#define PIN_DIR_OUTPUT	0
#define PIN_DIR_INPUT	1
#define PIN_VAL_LOW		0
#define PIN_VAL_HIGH	1

// The above are condensed into these.
#define PIN_SET_OUTPUT_LOW	0
#define PIN_SET_OUTPUT_HIGH	1
#define PIN_SET_INPUT		2




/*
 * Calculate checksum.
 */
static unsigned calculate_crc(unsigned crc, unsigned char *data, unsigned nbytes)
{
    static const unsigned short crc_table [16] = {
        0x0000, 0x1021, 0x2042, 0x3063, 0x4084, 0x50a5, 0x60c6, 0x70e7,
        0x8108, 0x9129, 0xa14a, 0xb16b, 0xc18c, 0xd1ad, 0xe1ce, 0xf1ef,
    };
    unsigned i;

    while (nbytes--) {
        i = (crc >> 12) ^ (*data >> 4);
        crc = crc_table[i & 0x0F] ^ (crc << 4);
        i = (crc >> 12) ^ (*data >> 0);
        crc = crc_table[i & 0x0F] ^ (crc << 4);
        data++;
    }
    return crc & 0xffff;
}

static void add_to_packet(neofoxx_adapter_t *a, uint8_t *data, uint32_t nbytes){
	// NB! Increase a-> bytes-to-write or something...

	// If packet not created, create packet
	if (0 == a->bytes_to_write){
		a->output[a->bytes_to_write++] = PACKET_BYTE;
		a->output[a->bytes_to_write++] = 0;	// Length byte 1. Init at 0.
		a->output[a->bytes_to_write++] = 0;	// Length byte 0. Init at 0.
	}

	// If created, add to packet
	memcpy(&(a->output[a->bytes_to_write]), data, nbytes);
	a->bytes_to_write = a->bytes_to_write + nbytes;

	// Should also check for maxLength, but can do that later.

	// In write function, add CRC and send
} 

/*
 * Send a packet to USB device.
 */
static void bulk_write(neofoxx_adapter_t *a, unsigned char *output, int nbytes){

	// Add CRC to packet. Send.
	uint32_t position = 0;
	uint32_t counter = 0;
	int32_t temp;
	uint16_t shortTemp;
	uint32_t i;

	if (debug_level > 2) {
		fprintf(stderr, "Neofoxx: In function bulk write\n");
	}

	if (4 > a->bytes_to_write){
		fprintf(stderr, "ERR: Less than 4 bytes in bulk write\n");
		if (debug_level > 2){
			for (i=0; i<a->bytes_to_write; i++){
				fprintf(stderr, "%c%02x", i ? '-' : ' ', a->output[i]);
			}
		}
		return;
	}


	uint32_t crc = 0;
	for (counter = 2; counter < a->bytes_to_write; counter++){
		crc = crc + a->output[counter];
	}
	a->output[a->bytes_to_write++] = (uint8_t)(crc & 0xFF);	// Add CRC, increase counter by 1


	// First save length of data to be sent. Length is total packet - 2
	shortTemp = a->bytes_to_write - 3;// Minus 1B for 'p', minus 2B for length
	//memcpy(&(a->output[1]), &shortTemp, sizeof(shortTemp)); 
	// Endiannes ><. Maybe change later or something.
	a->output[2] = shortTemp >> 8;
	a->output[1] = shortTemp & 0xFF;

	

	if (debug_level > 1) {
		int32_t i;
		fprintf(stderr, "Bulk write %d bytes:", a->bytes_to_write);
		for (i=0; i<a->bytes_to_write; i++){
			fprintf(stderr, "%c%02x", i ? '-' : ' ', a->output[i]);
		}
		fprintf(stderr, "\n");
	}

	while (0 < a->bytes_to_write){
		temp = serial_write(&(a->output[position]), a->bytes_to_write);
		if (0 > temp){
			// Error occured during writing.
			fprintf(stderr, "Error during writing\n");
		}
		else{
			position = position + temp;
			a->bytes_to_write = a->bytes_to_write - temp;
		}
	}
}

/*
 * If there are any data in transmit buffer -
 * send them to device.
 */
static void neofoxx_flush_output(neofoxx_adapter_t *a)
{
    int32_t bytes_read;

    if (a->bytes_to_write <= 0)
        return;

	// Write what we have to write
    bulk_write(a, a->output, a->bytes_to_write);
    a->bytes_to_write = 0;
    if (a->bytes_to_read <= 0){
        return;
	}
	
	//fprintf(stderr, "Reading data\n");
    /* Get reply. */
    a->bytes_in_buffer = 0;
    while (a->bytes_in_buffer < a->bytes_to_read) {
 		// Get data from device.
		// Don't forget to increment some bytes_in_buffer counter
		bytes_read = serial_read(&(a->input[a->bytes_in_buffer]),
						 (a->bytes_to_read - a->bytes_in_buffer), 1000);
//		fprintf(stderr, "Read %d bytes\n", bytes_read);
		a->bytes_in_buffer = a->bytes_in_buffer + bytes_read;
	}
    a->bytes_to_read = 0;
	a->current_pos_input = 0;
}

//
//	Get capabilities of the debug probe
//
static void neofoxx_get_capabilities(neofoxx_adapter_t *a){
	// Send the info packet, receive it, and decode it.
	// In it should be:
	// - The MCU itself,
	// - Speed support (limited, full)
	// - VERSION of FW - important for SW support!
	// - Something something something.

	// First FLUSH the output -> we'll leave that to the user/prograammer
	// Reset incoming buffer

	// Send proper packet
	uint8_t data[8];
	uint32_t nbytes = 0;
	data[nbytes++] = COMMAND_GET_INFO;
	add_to_packet(a, data, nbytes);

	a->bytes_to_read = 128;	// Fixed length read.
	neofoxx_flush_output(a);
	
	

