Neofoxx/pic32prog/adapter-neofoxx.c
	// Receive data - already done in flush_output
	
	// Decode and display :D
	if (debug_level > 1){
		fprintf(stderr, "Got %d data from device:\n%s\n", a->bytes_in_buffer, a->input);
	}
	char* token = strtok((char*)a->input, "\n");
	while (token != NULL){
		//printf("%s\n", token);
		if (0 == strncmp(token, "INFO", 4)){
			// INFO part / first line, nothing to do
		}
		else if (0 == strncmp(token, "MCU:", 4)){
			// MCU part
			uint8_t * position = (uint8_t *)strchr(token, ' ');
			strcpy((char*)a->capabilities_mcu, (char*)position+1);	// Remove ' '
			printf("MCU is %s\n", a->capabilities_mcu);
		}
		else if (0 == strncmp(token, "MODE:", 5)){
			uint8_t * position = (uint8_t *)strchr(token, ' ');
			strcpy((char*)a->capabilities_mcu, (char*)position+1);	// Remove ' '
			printf("MODE is %s\n", a->capabilities_mcu);			
		}
		else if(0 == strncmp(token, "NAME:", 5)){
			uint8_t * position = (uint8_t *)strchr(token, ' ');
			strcpy((char*)a->name, (char*)position+1);	// Remove ' '
			printf("NAME is %s\n", a->name);
		}
		// Others maybe later

		token = strtok(NULL, "\n");
	}

	a->bytes_in_buffer = 0;
}


// Poke the adapter into the proper pin state.
static void neofoxx_setProgMode(neofoxx_adapter_t *a, int mode, int immediate){
	uint8_t data[8];
	uint32_t nbytes = 0;
	data[nbytes++] = COMMAND_SET_PROG_MODE;
	data[nbytes++] = mode;
	add_to_packet(a, data, nbytes);
	
	// No read-back

	if (immediate){
		neofoxx_flush_output(a);
	}
}




// Control pins individually, which can be quite handy.
// Just don't forget which state you're in :D
static void neofoxx_setPins(neofoxx_adapter_t *a, int preset, int pin,
							int pin_dir, int pin_val, int immediate) {

	// In this function, if called with preset, it calls the TRISTATE/JTAG/ICSP
	// setup function. If called with -1, it'll send the pin_dir and pin_val.
	
	uint8_t data[8];
	uint32_t nbytes = 0;
	data[nbytes++] = COMMAND_SET_PIN_IO_MODE;
	data[nbytes++] = pin;
	if (PIN_DIR_INPUT == pin_dir){
		data[nbytes++] = PIN_SET_INPUT;
	}
	else{	// PIN_DIR_OUTPUT
		if (PIN_VAL_LOW == pin_val){
			data[nbytes++] = PIN_SET_OUTPUT_LOW;
		}
		else{
			data[nbytes++] = PIN_SET_OUTPUT_HIGH;
		}
	}

	add_to_packet(a, data, nbytes);
	
	// No read-back

	if (immediate){
		neofoxx_flush_output(a);
	}

}

static void neofoxx_send(neofoxx_adapter_t *a,
    uint32_t tms_prolog_nbits, uint32_t tms_prolog,
    uint32_t tdi_nbits, uint64_t tdi,
    uint32_t tms_epilog_nbits, uint32_t tms_epilog, int32_t read_flag){

	// Just construct a proper command and add to packet.
	uint8_t data[64];
	uint32_t nbytes = 0;
	data[nbytes++] = COMMAND_SEND;

	// TMS epilog
	memcpy(&(data[nbytes]), &tms_prolog_nbits, sizeof(tms_prolog_nbits));
	nbytes = nbytes + sizeof(tms_prolog_nbits);
	memcpy(&(data[nbytes]), &tms_prolog, sizeof(tms_prolog));
	nbytes = nbytes + sizeof(tms_prolog);

	// TDI
	memcpy(&(data[nbytes]), &tdi_nbits, sizeof(tdi_nbits));
	nbytes = nbytes + sizeof(tdi_nbits);
	memcpy(&(data[nbytes]), &tdi, sizeof(tdi));
	nbytes = nbytes + sizeof(tdi);

	// TMS epilog
	memcpy(&(data[nbytes]), &tms_epilog_nbits, sizeof(tms_epilog_nbits));
	nbytes = nbytes + sizeof(tms_epilog_nbits);
	memcpy(&(data[nbytes]), &tms_epilog, sizeof(tms_epilog));
	nbytes = nbytes + sizeof(tms_epilog);

	// read flag
	memcpy(&(data[nbytes]), &read_flag, sizeof(read_flag));
	nbytes = nbytes + sizeof(read_flag);

	add_to_packet(a, data, nbytes);
	if (read_flag){
		a->bytes_to_read = a->bytes_to_read + sizeof(uint64_t);	// Important!
	}
	
	// assert here, but uint64_t should == 8
}

static uint64_t neofoxx_recv(neofoxx_adapter_t *a){
    uint64_t word;

    /* Send a packet if there is anything to send */
    neofoxx_flush_output(a);

	uint32_t i;
/*
	fprintf(stderr, "In _recv\n");
	for (i=0; i<a->bytes_in_buffer; i++){
		fprintf(stderr, "%c%02x", i ? '-' : ' ', a->input[i]);
	}
*/	

	/* Todo here, check if there are more than just 8 bytes in the receive buffer
	 * 'cos currently this works for just one uint64_t */

    /* Process a reply: one 64-bit word. */
	// Increase/decrease counter or something!
	// Also, all packet reconstruction already done on device.
	// Can check if current_pos_input equals bytes_in_buffer.
    memcpy(&word, &(a->input[a->current_pos_input]), sizeof(word));
	a->current_pos_input = a->current_pos_input + sizeof(word);
    return(word);
}

static uint32_t neofoxx_bitReversal(uint32_t input){
    uint32_t output = 0;
    uint32_t counter = 0;
    for(counter=0; counter<32; counter++){
        if(input & (1<<counter)){
            output = output | (1<<(31-counter));
        }
    }
    return output;
}

static void neofoxx_setMode(neofoxx_adapter_t *a, uint32_t mode, uint32_t immediate){
    
	if (debug_level > 2){
		fprintf(stderr, "In _setMode\n");
	}
    if (SET_MODE_TAP_RESET == mode){
        /* TMS 1-1-1-1-1-0 */
        neofoxx_send(a, TMS_HEADER_RESET_TAP_NBITS, TMS_HEADER_RESET_TAP_VAL, 0, 0, 0, 0, 0);
    }
    else if (SET_MODE_EXIT == mode){
        /* TMS 1-1-1-1-1 */
        neofoxx_send(a, 5, 0x1F, 0, 0, 0, 0, 0);
    }
    else if (SET_MODE_ICSP_SYNC == mode && (INTERFACE_JTAG == a->interface || INTERFACE_DEFAULT == a->interface)){
        // In JTAG mode, send the MCHP key to enter ICSP on the TMS line.
		uint32_t entryCode = 0x4D434850;   // MCHP in ascii.
		entryCode = neofoxx_bitReversal(entryCode);
		neofoxx_send(a, 8, entryCode & 0xFF, 0, 0, 0, 0, 0);
		neofoxx_send(a, 8, (entryCode >> 8) & 0xFF, 0, 0, 0, 0, 0);
		neofoxx_send(a, 8, (entryCode >> 16) & 0xFF, 0, 0, 0, 0, 0);
		neofoxx_send(a, 8, (entryCode >> 24) & 0xFF, 0, 0, 0, 0, 0);

    }
    else{
        fprintf(stderr, "neofoxx_setMode called with invalid mode, quitting\n");
        exit(-1);
    }
    if (immediate){
        neofoxx_flush_output(a);
    }
	if (debug_level > 2){
		fprintf(stderr, "End of _setMode\n");
	}
}

static void neofoxx_sendCommand(neofoxx_adapter_t *a, uint32_t command, uint32_t immediate){
    // All 5-bit commands. The 8-bit ones are command_DR, go through XferData
    if (MTAP_COMMAND != command && TAP_SW_MTAP != command       // MTAP commands
        && TAP_SW_ETAP != command && MTAP_IDCODE != command     // MTAP commands
        && ETAP_ADDRESS != command && ETAP_DATA != command      // ETAP commands
        && ETAP_CONTROL != command && ETAP_EJTAGBOOT != command // ETAP commands
        && ETAP_FASTDATA != command && ETAP_NORMALBOOT != command){ // ETAP commands
        fprintf(stderr, "neofoxx_sendCommand called with invalid command 0x%02x, quitting\n", command);
        exit(-1);   // TODO make exit procedure
    }

    if (MTAP_COMMAND != command && TAP_SW_MTAP != command 
        && TAP_SW_ETAP != command && MTAP_IDCODE != command){   // MTAP commands
        neofoxx_send(a, TMS_HEADER_COMMAND_NBITS, TMS_HEADER_COMMAND_VAL,
                    MTAP_COMMAND_NBITS, command,
                    TMS_FOOTER_COMMAND_NBITS, TMS_FOOTER_COMMAND_VAL,
                    0);
    }
    else if (ETAP_ADDRESS != command && ETAP_DATA != command    // ETAP commands
            && ETAP_CONTROL != command && ETAP_EJTAGBOOT != command 
            && ETAP_FASTDATA != command && ETAP_NORMALBOOT != command){
        neofoxx_send(a, TMS_HEADER_COMMAND_NBITS, TMS_HEADER_COMMAND_VAL,
                    ETAP_COMMAND_NBITS, command,
                    TMS_FOOTER_COMMAND_NBITS, TMS_FOOTER_COMMAND_VAL,
                    0);
    }
    if (immediate){
        neofoxx_flush_output(a);
    }

