Neofoxx/pic32prog/adapter-neofoxx.c
}


static uint64_t neofoxx_xferData(neofoxx_adapter_t *a, uint32_t nBits, 
                uint32_t iData, uint32_t readFlag, uint32_t immediate){
    neofoxx_send(a, TMS_HEADER_XFERDATA_NBITS, TMS_HEADER_XFERDATA_VAL,
                    nBits, iData, 
                    TMS_FOOTER_XFERDATA_NBITS, TMS_FOOTER_XFERDATA_VAL,
                    readFlag);
    if (readFlag){
        /* Flushes the output data, and returns the data */
        return neofoxx_recv(a);
    }
    if (immediate){
        neofoxx_flush_output(a);
    }
    return 0;
}

static uint64_t neofoxx_xferFastData(neofoxx_adapter_t *a, unsigned word, uint32_t readFlag, uint32_t immediate)
{
    uint64_t temp;
    neofoxx_send(a, TMS_HEADER_XFERDATAFAST_NBITS, TMS_HEADER_XFERDATAFAST_VAL,
                    33, (unsigned long long) word << 1,
                    TMS_FOOTER_XFERDATAFAST_NBITS, TMS_FOOTER_XFERDATAFAST_VAL,
                    1);
    temp = neofoxx_recv(a);
    if (!(temp & 0x01)){
        fprintf(stderr, "Warning: PrACC not set in xferFastData\n");
    }
    if (readFlag){
        return temp;
    }
    return 0;
}

static void neofoxx_xferInstruction(neofoxx_adapter_t *a, unsigned instruction)
{
    unsigned ctl;
    unsigned maxCounter = 0;

    if (debug_level > 1){
        fprintf(stderr, "%s: xfer instruction %08x\n", a->name, instruction);
	}

    /* Select Control Register */
    neofoxx_sendCommand(a, ETAP_CONTROL, 1); // ETAP_CONTROL, immediate

    // Wait until CPU is ready
    // Check if Processor Access bit (bit 18) is set
    do {
        ctl = neofoxx_xferData(a, 32, (CONTROL_PRACC | CONTROL_PROBEN 
            | CONTROL_PROBTRAP | CONTROL_EJTAGBRK), 1, 1);    // Send data, readflag, immediate don't care
        // For MK family, PRACC doesn't cut it.
//        if ((! (ctl & CONTROL_PRACC))){
        if (!(ctl & CONTROL_PROBEN)){  
            fprintf(stderr, "xfer instruction, ctl was %08x\n", ctl);
            maxCounter++;
            if (maxCounter > 40){
                fprintf(stderr, "Processor still not ready. Quitting\n");
                exit(-1);   // TODO exit procedure
            }
            mdelay(1000);
        }
//    } while (! (ctl & CONTROL_PRACC));
    } while (! (ctl & CONTROL_PROBEN));

    /* Select Data Register */
    neofoxx_sendCommand(a, ETAP_DATA, 1);    // ETAP_DATA, immediate

    /* Send the instruction */
    neofoxx_xferData(a, 32, instruction, 0, 1);  // Send instruction, don't read, immediate

    /* Tell CPU to execute instruction */
    neofoxx_sendCommand(a, ETAP_CONTROL, 1); // ETAP_CONTROL, immediate
    /* Send data. */
    neofoxx_xferData(a, 32, (CONTROL_PROBEN | CONTROL_PROBTRAP), 0, 1);   // Send data, no readback, immediate
}

static void neofoxx_speed(neofoxx_adapter_t *a, int khz)
{
	fprintf(stderr, "Function not implemented yet\n"); 
	
	// Todo, if at all
	// For some devices, speed will be variable (in khz/divisor steps).
	// For some (bitbangers) there'll be just fast/maybe medium/slow.
}

static void neofoxx_close(adapter_t *adapter, int power_on)
{
    neofoxx_adapter_t *a = (neofoxx_adapter_t*) adapter;

    neofoxx_sendCommand(a, TAP_SW_ETAP, 1);  
    neofoxx_setMode(a, SET_MODE_TAP_RESET, 1);   // Send TAP reset, immediate
    mdelay(10);

    // Toggle MCLR.
    neofoxx_setPins(a, -1, PIN_MCLR, PIN_DIR_OUTPUT, PIN_VAL_LOW, 1); // Reset, immediate
    mdelay(100);    // Hold in reset for a bit, so it auto-runs afterwards 
    neofoxx_setPins(a, -1, PIN_MCLR, PIN_DIR_OUTPUT, PIN_VAL_HIGH, 1); // No reset, immediate

    serial_close();
    free(a);
}

/*
 * Read the Device Identification code
 */
static unsigned neofoxx_get_idcode(adapter_t *adapter)
{
    neofoxx_adapter_t *a = (neofoxx_adapter_t*) adapter;
    unsigned idcode;

    /* Reset the JTAG TAP controller: TMS 1-1-1-1-1-0.
     * After reset, the IDCODE register is always selected.
     * Read out 32 bits of data. */
    neofoxx_setMode(a, SET_MODE_TAP_RESET, 1);    /* Send TAP reset, immediate */
    idcode = neofoxx_xferData(a, 32, 0, 1, 1);    /* Send 32 0s, receive, immediate (don't care) */
    return idcode;
}

/* Sends the special command to enter ICSP mode */
static void neofoxx_enter_icsp(neofoxx_adapter_t *a)
{
	// TODO how to do this section
	// Fuck it, implement it on the MCU when its stable. Try bitbanging it from here first.
	
	uint32_t entryCode = 0x4D434850;   // MCHP in ascii.
                                       // Data is normally sent LSB first,
                                       // so we need to bit reverse this 
	unsigned tempInterface = a->interface;	// Save, this might come in handy in JTAG too.
	uint32_t counter = 0;
	entryCode = neofoxx_bitReversal(entryCode);

	neofoxx_setPins(a, -1, PIN_MCLR, PIN_DIR_OUTPUT, PIN_VAL_LOW, 1); // Reset, immediate
	neofoxx_setPins(a, -1, PIN_TMS, PIN_DIR_OUTPUT, PIN_VAL_LOW, 1); // TMS LOW, immediate
	neofoxx_setPins(a, -1, PIN_TCK, PIN_DIR_OUTPUT, PIN_VAL_LOW, 1); // TCK LOW, immediate
	mdelay(10);
	neofoxx_setPins(a, -1, PIN_MCLR, PIN_DIR_OUTPUT, PIN_VAL_HIGH, 1); // No reset, immediate
	mdelay(10);
	neofoxx_setPins(a, -1, PIN_MCLR, PIN_DIR_OUTPUT, PIN_VAL_LOW, 1); // Reset, immediate
	mdelay(10);

	// Send the 32 bits here.
	for (counter=0; counter<32; counter++){
		neofoxx_setPins(a, -1, PIN_TMS, PIN_DIR_OUTPUT, 
						(entryCode & (0x01<<counter))?PIN_VAL_HIGH:PIN_VAL_LOW, 1); // TMS [val], immediate
		neofoxx_setPins(a, -1, PIN_TCK, PIN_DIR_OUTPUT, PIN_VAL_HIGH, 1); // TCK HIGH, immediate
		neofoxx_setPins(a, -1, PIN_TCK, PIN_DIR_OUTPUT, PIN_VAL_LOW, 1); // TCK LOW, immediate
	}
	
	mdelay(5);
	neofoxx_setPins(a, -1, PIN_MCLR, PIN_DIR_OUTPUT, PIN_VAL_HIGH, 1); // No reset, immediate
}

/*
 * Put device to serial execution mode.
 */
static void serial_execution(neofoxx_adapter_t *a)
{
    uint32_t counter = 20;
    uint32_t counterPre = 0;

    if (a->serial_execution_mode){
        return;
	}
    a->serial_execution_mode = 1;

    /* Enter serial execution. */
    if (debug_level > 0)
        fprintf(stderr, "%s: enter serial execution\n", a->name);

