Neofoxx/pic32prog/adapter-neofoxx.c
    /* Send command. */
    neofoxx_sendCommand(a, TAP_SW_MTAP, 0);  // Command, not immediate
    /* Reset TAP */
    neofoxx_setMode(a, SET_MODE_TAP_RESET, 1);    // Reset TAP, immediate
    /* Send command. */
    neofoxx_sendCommand(a, MTAP_COMMAND, 0);
    /* Xfer data. */
    uint64_t status = neofoxx_xferData(a, MTAP_COMMAND_DR_NBITS, MCHP_STATUS, 1, 1);
    if(!(status & MCHP_STATUS_CPS)){
        fprintf(stderr, "CPS bit is SET, please erase MCU first. Status: 0x%08x\n", (uint32_t)status);
        exit(-1);
    }

    do{

        if (INTERFACE_ICSP == a->interface){
            neofoxx_xferData(a, MTAP_COMMAND_DR_NBITS, MCHP_ASSERT_RST, 0, 1);    // Data, don't read, immediate
        }
        if (INTERFACE_JTAG == a->interface || INTERFACE_DEFAULT == a->interface){
			neofoxx_setPins(a, -1, PIN_MCLR, PIN_DIR_OUTPUT, PIN_VAL_LOW, 1); // Reset, immediate
            neofoxx_flush_output(a);
        }

        //neofoxx_setMode(a, SET_MODE_TAP_RESET, 1);    // Reset TAP, immediate
        /* Switch to ETAP */
        neofoxx_sendCommand(a, TAP_SW_ETAP, 1);   // Send command, immediate
        /* Reset TAP */
        neofoxx_setMode(a, SET_MODE_TAP_RESET, 1);    // Reset TAP, immediate
        /* Put CPU in Serial Exec Mode */
        neofoxx_sendCommand(a, ETAP_EJTAGBOOT, 1); // Send command, immediate
        
        if (INTERFACE_JTAG == a->interface || INTERFACE_DEFAULT == a->interface){
			neofoxx_setPins(a, -1, PIN_MCLR, PIN_DIR_OUTPUT, PIN_VAL_HIGH, 1); // No reset, immediate
            neofoxx_flush_output(a);
        }
        else{
            /* Else ICSP */
            /* Send command. */
            neofoxx_sendCommand(a, TAP_SW_MTAP, 1);
            /* Reset TAP */
            neofoxx_setMode(a, SET_MODE_TAP_RESET, 1);    // Reset TAP, immediate
            /* Send command. */
            neofoxx_sendCommand(a, MTAP_COMMAND, 1);
            /* Send command. */
            neofoxx_xferData(a, MTAP_COMMAND_DR_NBITS, MCHP_DEASSERT_RST, 0, 1);
            if (FAMILY_MX1 == a->adapter.family_name_short
                || FAMILY_MX3 == a->adapter.family_name_short){
                /* Send command, only for PIC32MX */
                neofoxx_xferData(a, MTAP_COMMAND_DR_NBITS, MCHP_FLASH_ENABLE, 0, 1);
            }
            /* Switch to ETAP */
            neofoxx_sendCommand(a, TAP_SW_ETAP, 1);
            neofoxx_setMode(a, SET_MODE_TAP_RESET, 1);    // Reset TAP, immediate
        }
    
        /* What is the value of ECR, after trying to connect */
        mdelay(10);
        neofoxx_setMode(a, SET_MODE_TAP_RESET, 1);
        neofoxx_sendCommand(a, TAP_SW_ETAP, 1);
        neofoxx_setMode(a, SET_MODE_TAP_RESET, 1);
        neofoxx_sendCommand(a, ETAP_CONTROL, 1);

        // At least on the MK chip, the first read is negative. Read again, and it's ok.
        counterPre = 11;
        do{
            status = neofoxx_xferData(a, 32, (CONTROL_PRACC | CONTROL_PROBEN | CONTROL_PROBTRAP), 1, 1);    // Send data, readflag, immediate, don't care
        }while(!(status & CONTROL_PROBEN) && counterPre-- > 1); 

//        if (!(status & CONTROL_PRACC)){   
        if (!(status & CONTROL_PROBEN)){   
            fprintf(stderr, "Failed to enter serial execution. Status was %08x\n", (uint32_t)status);
            if (INTERFACE_JTAG == a->interface || INTERFACE_DEFAULT == a->interface){  
                /* For these chips, ICSP & JTAG pins are (sometimes) shared. Can do a trick */
                if (FAMILY_MX1 == a->adapter.family_name_short
                    || FAMILY_MX3 == a->adapter.family_name_short)
                {
				    fprintf(stderr, "In JTAG mode, trying to recover automatically\n");
				    // MCLR is currently 1.
				    // We need to go 0, enter ICSP, go 1, go 0, repeat this do-while loop.
				    // NOTE!! This needs to be done on the TMS LINE! TDI should be held low, probably.
					neofoxx_setPins(a, -1, PIN_MCLR, PIN_DIR_OUTPUT, PIN_VAL_LOW, 1); // Reset, immediate
               		neofoxx_flush_output(a);
				    mdelay(5);
				    
				    neofoxx_setMode(a, SET_MODE_ICSP_SYNC, 1);
				    mdelay(5);

					neofoxx_setPins(a, -1, PIN_MCLR, PIN_DIR_OUTPUT, PIN_VAL_HIGH, 1); // No reset, immediate
               		neofoxx_flush_output(a);
				    mdelay(5);
                }
                else{
                    fprintf(stderr, "In JTAG mode, only recovery is through a power-cycle, or reset via ICSP. Quitting.\n");
                    exit(-1);
                }

				// Reset will be asserted in the beginning of the loop again.
				mdelay(100);			
            }
        }
        
    }while(!(status & CONTROL_PROBEN) && counter-- > 1);    // Repeat, until we sucessefully enter serial execution. Extend if necessary, to more than PROBEN!
    
    if (counter == 0){
        fprintf(stderr, "Couldn't enter serial execution, quitting\n");
    }

    mdelay(10);
}

static unsigned get_pe_response(neofoxx_adapter_t *a)
{
    unsigned ctl, response;

    // Select Control Register
    /* Send command. */
    neofoxx_sendCommand(a, ETAP_CONTROL, 1);	// Command, immediate

    // Wait until CPU is ready
    // Check if Processor Access bit (bit 18) is set
    do {
        ctl = neofoxx_xferData(a, 32, (CONTROL_PRACC | CONTROL_PROBEN 
                | CONTROL_PROBTRAP | CONTROL_EJTAGBRK), 1, 1);    // Send data, readflag, immediate don't care
    } while (! (ctl & CONTROL_PRACC));

    // Select Data Register
    // Send the instruction
    /* Send command. */
    neofoxx_sendCommand(a, ETAP_DATA, 1);

    /* Get data. */
    response = neofoxx_xferData(a, 32, 0, 1, 1);  // Send 32 zeroes, read response, immediate don't care

    // Tell CPU to execute NOP instruction
    /* Send command. */
    neofoxx_sendCommand(a, ETAP_CONTROL, 1);
    /* Send data. */
    neofoxx_xferData(a, 32, (CONTROL_PROBEN | CONTROL_PROBTRAP), 0, 1);

    if (debug_level > 1)
        fprintf(stderr, "%s: get PE response %08x\n", a->name, response);
    return response;
}

/*
 * Read a word from memory (without PE).
 */
static unsigned neofoxx_read_word(adapter_t *adapter, unsigned addr)
{
    neofoxx_adapter_t *a = (neofoxx_adapter_t*) adapter;
    unsigned addr_lo = addr & 0xFFFF;
    unsigned addr_hi = (addr >> 16) & 0xFFFF;
    unsigned word = 0;

