Neofoxx/pic32prog/adapter-neofoxx.c
        /* Jump to PE loader (step 6). */
        neofoxx_xferInstruction(a, 0x3c19a000);    // lui t9, 0xa000
        neofoxx_xferInstruction(a, 0x37390800);    // ori t9, 0x800  - t9 has a0000800
        neofoxx_xferInstruction(a, 0x03200008);    // jr  t9
        neofoxx_xferInstruction(a, 0x00000000);    // nop

        /* Switch from serial to fast execution mode. */
        neofoxx_sendCommand(a, TAP_SW_ETAP, 1);
        /* TMS 1-1-1-1-1-0 */
        neofoxx_setMode(a, SET_MODE_TAP_RESET, 1);

        /* Send parameters for the loader (step 7-A).
         * PE_ADDRESS = 0xA000_0900,
         * PE_SIZE */
        /* Send command. */
        neofoxx_sendCommand(a, ETAP_FASTDATA, 1);
        neofoxx_xferFastData(a, 0xa0000900, 0, 1);    /* Don't read, immediate */
        neofoxx_xferFastData(a, nwords, 0, 1);        /* Don't read, immediate */

        /* Download the PE itself (step 7-B). */
        if (debug_level > 0)
            fprintf(stderr, "%s: download PE\n", a->name);
        for (i=0; i<nwords; i++) {
            neofoxx_xferFastData(a, *pe++, 0, 0);     /* Don't read, not immediate */
        }
        neofoxx_flush_output(a);
        mdelay(10);

        /* Download the PE instructions. */
        /* Step 8 - jump to PE. */
        neofoxx_xferFastData(a, 0, 0, 1);             /* Don't read, immediate */                  
        neofoxx_xferFastData(a, 0xDEAD0000, 0, 1);    /* Don't read, immediate */
        mdelay(10);
        neofoxx_xferFastData(a, PE_EXEC_VERSION << 16, 0, 1); /* Don't read, immediate */
    }
    else{
        /* Else MM family */
        // Step 1. Setup PIC32MM RAM address for the PE 
		neofoxx_xferInstruction(a, 0xa00041a4);    // lui a0, 0xa000
		neofoxx_xferInstruction(a, 0x02005084);    // ori a0, a0, 0x200 A total of 0xa000_0200

		// Step 2. Load the PE_loader.
		int i;
		for (i=0; i<PIC32_PEMM_LOADER_LEN; i+=2) {
		    /* Step 5. */
		    unsigned opcode1 = 0x41A6 | (pic32_pemm_loader[i] << 16);
		    unsigned opcode2 = 0x50C6 | (pic32_pemm_loader[i+1] << 16);

		    neofoxx_xferInstruction(a, opcode1);       // lui a2, PE_loader_hi++
		    neofoxx_xferInstruction(a, opcode2);       // ori a2, a2, PE_loader_lo++
		    neofoxx_xferInstruction(a, 0x6E42EB40);    // sw  a2, 0(a0); addiu a0, a0, 4;
		}

		// Step 3. Jump to the PE_Loader
		neofoxx_xferInstruction(a, 0xA00041B9);       // lui t9, 0xa000
		neofoxx_xferInstruction(a, 0x02015339);       // ori t9, t9, 0x0800. Same address as at beginning +1.
		neofoxx_xferInstruction(a, 0x0C004599);       // jr t9; nop;

		/* These nops here are MANDATORY. And exactly this many.
		 * Less it doesn't work, more it doesn't work. */
		neofoxx_xferInstruction(a, 0x0C000C00);
		neofoxx_xferInstruction(a, 0x0C000C00);

		// Step 4. Load the PE using the PE_loader
		// Switch to ETAP
		neofoxx_sendCommand(a, TAP_SW_ETAP, 1);
		/* TMS 1-1-1-1-1-0 */
		neofoxx_setMode(a, SET_MODE_TAP_RESET, 1);
		// Set to FASTDATA
		neofoxx_sendCommand(a, ETAP_FASTDATA, 1);

		// Send PE_ADDRESS, Address os PE program block from PE Hex file
		neofoxx_xferFastData(a, 0xA0000300, 0, 1);	// Taken from the .hex file.
		
		// Send PE_SIZE, number as 32-bit words of the program block from the PE Hex file
		neofoxx_xferFastData(a, nwords, 0, 1);        // Data, don't read, immediate (wasn't before)

		if (debug_level > 0){
			fprintf(stderr, "%s: download PE, nwords = %d\n", a->name, nwords);
			//mdelay(3000);		
		}
		for (i=0; i<nwords; i++) {
			neofoxx_xferFastData(a, *pe++, 0, 0);     // Data, don't read, no immediate
		}
		neofoxx_flush_output(a);
		mdelay(10);

		// Step 5, Jump to the PE.
		neofoxx_xferFastData(a, 0x00000000, 0, 1);
		neofoxx_xferFastData(a, 0xDEAD0000, 0, 1);

		// Done.
		// Get PE version?
		mdelay(10);
		neofoxx_xferFastData(a, PE_EXEC_VERSION << 16, 0, 1);     // Data, don't read, immediate (wasn't before)
    }
    
    unsigned version = get_pe_response(a);
    if (version != (PE_EXEC_VERSION << 16 | pe_version)) {
        fprintf(stderr, "%s: bad PE version = %08x, expected %08x\n",
            a->name, version, PE_EXEC_VERSION << 16 | pe_version);
        exit(-1);
    }
    if (debug_level > 0)
        fprintf(stderr, "%s: PE version = %04x\n",
            a->name, version & 0xffff);
}

/*
 * Erase all flash memory.
 */
static void neofoxx_erase_chip(adapter_t *adapter)
{
    neofoxx_adapter_t *a = (neofoxx_adapter_t*) adapter;
    unsigned status = 0;

    /* Switch to MTAP */
    neofoxx_sendCommand(a, TAP_SW_MTAP, 1);
    /* Reset TAP */
    neofoxx_setMode(a, SET_MODE_TAP_RESET, 1);
    /* Send command. */
    neofoxx_sendCommand(a, MTAP_COMMAND, 1);
    /* Xfer data. */
    neofoxx_xferData(a, MTAP_COMMAND_DR_NBITS, MCHP_ERASE, 0, 1);
    neofoxx_xferData(a, MTAP_COMMAND_DR_NBITS, MCHP_DEASSERT_RST, 0, 1);

    // https://www.microchip.com/forums/m627418.aspx .......
    if (INTERFACE_JTAG == a->interface || INTERFACE_DEFAULT == a->interface){
		neofoxx_setPins(a, -1, PIN_MCLR, PIN_DIR_OUTPUT, PIN_VAL_HIGH, 1); // No reset, immediate
    }

    do{
        status = neofoxx_xferData(a, MTAP_COMMAND_DR_NBITS, MCHP_STATUS, 1, 1);  // Send data, read response, immediate don't care
        //fprintf(stderr, "Status is 0x%08x ... \n", statuss);
        if (!(status & MCHP_STATUS_CFGRDY) || (status & MCHP_STATUS_FCBUSY)){
            printf(".");
            mdelay(10);
        }
    }while(!(status & MCHP_STATUS_CFGRDY) || (status & MCHP_STATUS_FCBUSY));

    neofoxx_setMode(a, SET_MODE_TAP_RESET, 1); 
    mdelay(25);
}

/*
 * Write a word to flash memory.
 */
static void neofoxx_program_word(adapter_t *adapter,
    unsigned addr, unsigned word)
{
    neofoxx_adapter_t *a = (neofoxx_adapter_t*) adapter;

    if (FAMILY_MM == a->adapter.family_name_short){
        fprintf(stderr, "Program word is not available on MM family. Quitting\n");
    }

    if (debug_level > 0)
        fprintf(stderr, "%s: program word at %08x: %08x\n", a->name, addr, word);
    if (! a->use_executive) {
        /* Without PE. */
        fprintf(stderr, "%s: slow flash write not implemented yet.\n", a->name);
        exit(-1);
    }

