Neofoxx/pic32prog/adapter-neofoxx.c
    /* Use PE to write flash memory. */
    /* Send command. */
    neofoxx_sendCommand(a, ETAP_FASTDATA, 1);

    neofoxx_xferFastData(a, PE_WORD_PROGRAM << 16 | 2, 0, 1); // Data, don't read, immediate
    neofoxx_xferFastData(a, addr, 0, 1);  /* Send address. */ // Data, don't read, immediate
    neofoxx_xferFastData(a, word, 0, 1);  /* Send word. */    // Data, don't read, immediate

    unsigned response = get_pe_response(a);
    if (response != (PE_WORD_PROGRAM << 16)) {
        fprintf(stderr, "%s: failed to program word %08x at %08x, reply = %08x\n",
            a->name, word, addr, response);
        exit(-1);
    }
}

static void neofoxx_program_double_word(adapter_t *adapter, unsigned addr, unsigned word0, unsigned word1){
    neofoxx_adapter_t *a = (neofoxx_adapter_t*) adapter;
    
    if (FAMILY_MM != a->adapter.family_name_short){
        fprintf(stderr, "Program double word is only available on MM family. Quitting\n");
    }

	if (debug_level > 0){
		fprintf(stderr, "%s: program double word at 0x%08x: 0x%08x 0x%08x\n", a->name, addr, word0, word1);
	}
	if (! a->use_executive) {
        /* Without PE. */
        fprintf(stderr, "%s: slow flash write not implemented yet.\n", a->name);
        exit(-1);
    }

	 /* Use PE to write flash memory. */
    /* Send command. */
    neofoxx_sendCommand(a, ETAP_FASTDATA, 1);
    // TODO - RECHECK the | 2!!!
    neofoxx_xferFastData(a, PE_DOUBLE_WORD_PGRM << 16 | 2, 0, 1); // Data, don't read, immediate
    neofoxx_xferFastData(a, addr, 0, 1);  	/* Send address. */ // Data, don't read, immediate
    neofoxx_xferFastData(a, word0, 0, 1);  	/* Send 1st word. */    // Data, don't read, immediate, was not before
    neofoxx_xferFastData(a, word1, 0, 1);  	/* Send 2nd word. */    // Data, don't read, immediate, was not before
 
    unsigned response = get_pe_response(a);
    if (response != (PE_DOUBLE_WORD_PGRM << 16)) {
        fprintf(stderr, "%s: failed to program double words 0x%08x 0x%08x at 0x%08x, reply = %08x\n",
            a->name, word0, word1, addr, response);
        exit(-1);
    }
	
}

static void neofoxx_program_quad_word(adapter_t *adapter, unsigned addr, 
            unsigned word0, unsigned word1, unsigned word2, unsigned word3){
    neofoxx_adapter_t *a = (neofoxx_adapter_t*) adapter;

    if (FAMILY_MK != a->adapter.family_name_short
        && FAMILY_MZ != a->adapter.family_name_short){
        fprintf(stderr, "Program quad word is only available on MK and MZ families. Quitting\n");
    }

	if (debug_level > 0){
		fprintf(stderr, "%s: program quad word at 0x%08x: 0x%08x 0x%08x 0x%08x 0x%08x\n",
                         a->name, addr, word0, word1, word2, word3);
	}
	if (! a->use_executive) {
        /* Without PE. */
        fprintf(stderr, "%s: slow flash write not implemented yet.\n", a->name);
        exit(-1);
    }

	 /* Use PE to write flash memory. */
    /* Send command. */
    neofoxx_sendCommand(a, ETAP_FASTDATA, 1);

    neofoxx_xferFastData(a, PE_QUAD_WORD_PGRM << 16, 0, 1); // Data, don't read, immediate
    neofoxx_xferFastData(a, addr, 0, 1);  	/* Send address. */ // Data, don't read, immediate
    neofoxx_xferFastData(a, word0, 0, 1);  	/* Send 1st word. */    // Data, don't read, immediate, was not before
    neofoxx_xferFastData(a, word1, 0, 1);  	/* Send 2nd word. */    // Data, don't read, immediate, was not before
    neofoxx_xferFastData(a, word2, 0, 1);  	/* Send 1st word. */    // Data, don't read, immediate, was not before
    neofoxx_xferFastData(a, word3, 0, 1);  	/* Send 2nd word. */    // Data, don't read, immediate, was not before
 
    unsigned response = get_pe_response(a);
    if (response != (PE_QUAD_WORD_PGRM << 16)) {
        fprintf(stderr, "%s: failed to program quad words 0x%08x 0x%08x 0x%08x 0x%08x at 0x%08x, reply = %08x\n",
            a->name, word0, word1, word2, word3, addr, response);
        exit(-1);
    }
	
}

/*
 * Flash write row of memory.
 */
static void neofoxx_program_row(adapter_t *adapter, unsigned addr,
    unsigned *data, unsigned words_per_row)
{
    neofoxx_adapter_t *a = (neofoxx_adapter_t*) adapter;
    int i;

    if (debug_level > 0)
        fprintf(stderr, "%s: row program %u words at %08x\n",
            a->name, words_per_row, addr);
    if (! a->use_executive) {
        /* Without PE. */
        fprintf(stderr, "%s: slow flash write not implemented yet.\n", a->name);
        exit(-1);
    }

    /* Use PE to write flash memory. */
    /* Send command. */
    neofoxx_sendCommand(a, ETAP_FASTDATA, 1); 

    neofoxx_xferFastData(a, PE_ROW_PROGRAM << 16 | words_per_row, 0, 1);  // Data, don't read, immediate
    neofoxx_xferFastData(a, addr, 0, 1);  /* Send address. */             // Data, don't read, immediate

    /* Download data. */
    for (i = 0; i < words_per_row; i++) {
        if ((i & 7) == 0)
            neofoxx_flush_output(a);
        neofoxx_xferFastData(a, *data++, 0, 0);   /* Send word. Don't read, not immediate */
    }
    neofoxx_flush_output(a);

    unsigned response = get_pe_response(a);
    if (response != (PE_ROW_PROGRAM << 16)) {
        fprintf(stderr, "%s: failed to program row at %08x, reply = %08x\n",
            a->name, addr, response);
        exit(-1);
    }
}

/*
 * Verify a block of memory.
 */
static void neofoxx_verify_data(adapter_t *adapter,
    unsigned addr, unsigned nwords, unsigned *data)
{
    neofoxx_adapter_t *a = (neofoxx_adapter_t*) adapter;
    unsigned data_crc, flash_crc;

    //fprintf(stderr, "%s: verify %d words at %08x\n", a->name, nwords, addr);
    if (! a->use_executive) {
        /* Without PE. */
        fprintf(stderr, "%s: slow verify not implemented yet.\n", a->name);
        exit(-1);
    }

    /* Use PE to get CRC of flash memory. */
    /* Send command. */
    neofoxx_sendCommand(a, ETAP_FASTDATA, 1);

    neofoxx_xferFastData(a, PE_GET_CRC << 16, 0, 1);  // Data, don't read, immediate
     /* Send address. */
    neofoxx_xferFastData(a, addr, 0, 1);              // Data, don't read, immediate
    /* Send length. */
    neofoxx_xferFastData(a, nwords * 4, 0, 1);        // Data, don't read, immediate

    unsigned response = get_pe_response(a);
    if (response != (PE_GET_CRC << 16)) {
        fprintf(stderr, "%s: failed to verify %d words at %08x, reply = %08x\n",
            a->name, nwords, addr, response);
        exit(-1);
    }
    flash_crc = get_pe_response(a) & 0xffff;
    data_crc = calculate_crc(0xffff, (unsigned char*) data, nwords * 4);
    if (flash_crc != data_crc) {
        fprintf(stderr, "%s: checksum failed at %08x: sum=%04x, expected=%04x\n",
            a->name, addr, flash_crc, data_crc);
        //exit(-1);
    }
}

