Neofoxx/pic32prog/adapter-neofoxx.c
/*
 * Initialize adapter F2232.
 * Return a pointer to a data structure, allocated dynamically.
 * When adapter not found, return 0.
 * Parameters vid, pid and serial are not used.
 */
adapter_t *adapter_open_neofoxx(const char *port, int baudrate, int interface, int speed)
{
    neofoxx_adapter_t *a;

    a = calloc(1, sizeof(*a));
    if (! a) {
        fprintf(stderr, "adapter_open_neofoxx: out of memory\n");
        return 0;
    }
    //a->context = NULL;

	
	if (serial_open(port, baudrate) < 0) {
        /* Failed to open serial port */
        fprintf(stderr, "Unable to open serial port %s\n", port);
        serial_close();
        free(a);
        return 0;
    }

	a->capabilities_mcu[0] = 0;
	neofoxx_get_capabilities(a);	// Populate struct with info
	if (a->capabilities_mcu[0] == '\0'){
		fprintf(stderr, "Unable to get information about adapter\n");
		serial_close();
        free(a);
        return 0;
	}

  
	fprintf(stderr, "Found adapter %s\n:", a->name);
	// TODO printout capabilities

	a->interface = interface;	// TODO do different later or something

	// Have to set, otherwise things don't work :p
	if (a->interface == INTERFACE_DEFAULT || a->interface == INTERFACE_JTAG){
		neofoxx_setProgMode(a, PROG_MODE_JTAG, 1); // Setup for tristate output, immediate
	}
	else if (a->interface == INTERFACE_ICSP){
		neofoxx_setProgMode(a, PROG_MODE_ICSP, 1); // Setup for tristate output, immediate
	}
	else{
		fprintf(stderr, "Unsupported itnerface specified\n");
		serial_close();
        free(a);
        return 0;
	}


    /* By default, use 500 kHz speed, unless specified */
    neofoxx_speed(a, speed);
	// TODO prinout what's the actual frequency



    /* Activate LED. */
    // Maybe later, or LCD.

    unsigned idcode = 0;
    uint32_t counter = 11;
    do{
        if (INTERFACE_ICSP == a->interface){
            neofoxx_enter_icsp(a);
        }

        /* Delay required for ICSP */
        mdelay(5);     

        /* Reset the JTAG TAP controller: TMS 1-1-1-1-1-0.
         * After reset, the IDCODE register is always selected.
         * Read out 32 bits of data. */
        

        neofoxx_setMode(a, SET_MODE_TAP_RESET, 1);
        neofoxx_sendCommand(a, TAP_SW_MTAP, 1);
        neofoxx_setMode(a, SET_MODE_TAP_RESET, 1);
        neofoxx_sendCommand(a, MTAP_IDCODE, 1);

        idcode = neofoxx_xferData(a, 32, 0, 1, 1);
        if ((idcode & 0xfff) != 0x053) {
            /* Microchip vendor ID is expected. */
            if (debug_level > 0 || (idcode != 0 && idcode != 0xffffffff))
                fprintf(stderr, "%s: incompatible CPU detected, IDCODE=%08x\n",
                    a->name, idcode);
            fprintf(stderr, "IDCODE not valid, retrying\n");
        }
    }while((idcode & 0xfff) != 0x053 && counter-- > 1);
    if(counter == 0){
		neofoxx_setPins(a, -1, PIN_MCLR, PIN_DIR_OUTPUT, PIN_VAL_HIGH, 1); // No reset, immediate
        fprintf(stderr, "Couldn't read IDCODE, exiting\n");
		// Instead of goto failed;        
		serial_close();
        free(a);
        return 0;
    }
    printf("      IDCODE=%08x\n", idcode);

    /* Activate /SYSRST and LED. Only done in JTAG mode */
    if (INTERFACE_JTAG == a->interface || INTERFACE_DEFAULT == a->interface)
    {
		neofoxx_setPins(a, -1, PIN_MCLR, PIN_DIR_OUTPUT, PIN_VAL_LOW, 1); // Reset, immediate

        // So, the MM family's JTAG doesn't work in RESET...      
        // Works like this for all the others as well.  
        mdelay(10);
		neofoxx_setPins(a, -1, PIN_MCLR, PIN_DIR_OUTPUT, PIN_VAL_HIGH, 1); // No reset, immediate

    } 
    mdelay(10);

    /* Check status. */
    /* Send command. */
    neofoxx_sendCommand(a, TAP_SW_MTAP, 1);
    /* Send command. */
    neofoxx_sendCommand(a, MTAP_COMMAND, 1);
    /* Xfer data. */
    neofoxx_xferData(a, MTAP_COMMAND_DR_NBITS, MCHP_FLASH_ENABLE, 0, 1);
    /* Xfer data. */
    unsigned status = neofoxx_xferData(a, MTAP_COMMAND_DR_NBITS, MCHP_STATUS, 1, 1);
    
    if (debug_level > 0)
        fprintf(stderr, "%s: status %04x\n", a->name, status);
    if ((status & (MCHP_STATUS_CFGRDY | MCHP_STATUS_FCBUSY)) != (MCHP_STATUS_CFGRDY)) {
        fprintf(stderr, "%s: invalid status = %04x\n", a->name, status);
        neofoxx_setProgMode(a, PROG_MODE_TRISTATE, 1); // Setup for tristate output, immediate
        // Instead of goto failed;        
		serial_close();
        free(a);
        return 0;
    }
    printf("      Adapter: %s\n", a->name);

    a->adapter.block_override = 0;
    a->adapter.flags = (AD_PROBE | AD_ERASE | AD_READ | AD_WRITE);

    /* User functions. */
    a->adapter.close = neofoxx_close;
    a->adapter.get_idcode = neofoxx_get_idcode;
    a->adapter.load_executive = neofoxx_load_executive;
    a->adapter.read_word = neofoxx_read_word;
    a->adapter.read_data = neofoxx_read_data;
    a->adapter.verify_data = neofoxx_verify_data;
    a->adapter.erase_chip = neofoxx_erase_chip;
    a->adapter.program_word = neofoxx_program_word;
    a->adapter.program_row = neofoxx_program_row;
    a->adapter.program_double_word = neofoxx_program_double_word;
    a->adapter.program_quad_word = neofoxx_program_quad_word;
    return &a->adapter;
}
